package pgap;

public class MainPGAP {

	/**
	 * あなたはあるプロジェクトのPMをしています。
	 * プロジェクトのメンバーにはモチベーションが落ちているメンバーがいます。
	 * PMがモチベーションの落ちているメンバーに声をかけるとことでモチベーションが回復します。
	 * またPMが声をかけてモチベーションが回復したメンバーは両隣のメンバーのモチベーションを回復してくれます。
	 * PMが声をかけれる回数が決まってる時、プロジェクトメンバーのモチベーションが落ちていない人数の最大値を求めて下さい。
	 *
	 * @param lines
	 *     配列 0 : "m k" ( m がメンバー数, k が声をかけれる回数 )
	 *     配列 1 : "members ex) ...H..H." ( "." が落ちてるメンバー, "H" が落ちてないメンバー )
	 * @return モチベーションが落ちてない最大人数
	 */
	public static int execution(String[] lines) {

		return 0;
	}
}